In [1]:
import pandas as pd

In [2]:
data = {
    "names" : ["Rohit","Sachin","Virat","Yuvraj","Sehwag","Dhawan","Raina","Dhoni"],
    "runs" : [120, 213, 232, 290, 102, 430, 321, 340],
    "average" : [45.5,51.2,29.8,39.7,41.5,46.7,54.3,50.5]
}

In [3]:
pd.Series(data)

names      [Rohit, Sachin, Virat, Yuvraj, Sehwag, Dhawan,...
runs                [120, 213, 232, 290, 102, 430, 321, 340]
average     [45.5, 51.2, 29.8, 39.7, 41.5, 46.7, 54.3, 50.5]
dtype: object

In [5]:
df = pd.DataFrame(data)

In [6]:
df.head()

    names  runs  average
0   Rohit   120     45.5
1  Sachin   213     51.2
2   Virat   232     29.8
3  Yuvraj   290     39.7
4  Sehwag   102     41.5

In [7]:
df.shape

(8, 3)

In [8]:
df.describe()

             runs    average
count    8.000000   8.000000
mean   256.000000  44.900000
std    111.707526   7.834174
min    102.000000  29.800000
25%    189.750000  41.050000
50%    261.000000  46.100000
75%    325.750000  50.675000
max    430.000000  54.300000

In [10]:
df['names'].head()

0     Rohit
1    Sachin
2     Virat
3    Yuvraj
4    Sehwag
Name: names, dtype: object

In [12]:
df.sort_values(['runs'])

    names  runs  average
4  Sehwag   102     41.5
0   Rohit   120     45.5
1  Sachin   213     51.2
2   Virat   232     29.8
3  Yuvraj   290     39.7
6   Raina   321     54.3
7   Dhoni   340     50.5
5  Dhawan   430     46.7

In [13]:
df.sort_values(['runs'], ascending=False)

    names  runs  average
5  Dhawan   430     46.7
7   Dhoni   340     50.5
6   Raina   321     54.3
3  Yuvraj   290     39.7
2   Virat   232     29.8
1  Sachin   213     51.2
0   Rohit   120     45.5
4  Sehwag   102     41.5

In [14]:
df.sort_values(['runs'], ascending=False).reset_index()

   index   names  runs  average
0      5  Dhawan   430     46.7
1      7   Dhoni   340     50.5
2      6   Raina   321     54.3
3      3  Yuvraj   290     39.7
4      2   Virat   232     29.8
5      1  Sachin   213     51.2
6      0   Rohit   120     45.5
7      4  Sehwag   102     41.5

In [15]:
df.sort_values(['runs'], ascending=False).reset_index(drop=True)

    names  runs  average
0  Dhawan   430     46.7
1   Dhoni   340     50.5
2   Raina   321     54.3
3  Yuvraj   290     39.7
4   Virat   232     29.8
5  Sachin   213     51.2
6   Rohit   120     45.5
7  Sehwag   102     41.5

In [17]:
df['names'].unique()

array(['Rohit', 'Sachin', 'Virat', 'Yuvraj', 'Sehwag', 'Dhawan', 'Raina',
       'Dhoni'], dtype=object)

In [19]:
df[0:3]

    names  runs  average
0   Rohit   120     45.5
1  Sachin   213     51.2
2   Virat   232     29.8

In [21]:
df.iloc[0:3, 0:2]

    names  runs
0   Rohit   120
1  Sachin   213
2   Virat   232

In [22]:
df.loc[0]

names      Rohit
runs         120
average     45.5
Name: 0, dtype: object

In [23]:
df.iloc[0]

names      Rohit
runs         120
average     45.5
Name: 0, dtype: object

In [24]:
df.loc[0:2]

    names  runs  average
0   Rohit   120     45.5
1  Sachin   213     51.2
2   Virat   232     29.8

In [26]:
df.iloc[0:2]

    names  runs  average
0   Rohit   120     45.5
1  Sachin   213     51.2